In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('age_18_30.csv')

In [3]:
df

     age
0     18
1     20
2     21
3     22
4     23
..   ...
115   21
116   23
117   29
118   30
119   25

[120 rows x 1 columns]

In [4]:
df.age.mean()

23.566666666666666

In [5]:
df.age.std()

3.2480979135522396

In [6]:
df.age.median()

23.0

In [11]:
df2=pd.read_csv('age_group_31-50.csv')

In [8]:
df

     age
0     18
1     20
2     21
3     22
4     23
..   ...
115   21
116   23
117   29
118   30
119   25

[120 rows x 1 columns]

In [12]:
df2

    age2
0     32
1     35
2     37
3     40
4     45
5     41
6     40
7     39
8     37
9     35
10    32
11    36
12    38
13    41
14    40
15    48
16    37
17    36
18    31
19    33
20    38
21    46
22    48
23    50
24    49
25    42
26    41
27    35
28    32
29    37
30    36
31    31
32    33
33    30
34    45
35    41
36    36
37    38
38    40
39    42
40    44
41    45
42    47
43    34
44    33
45    31
46    33
47    37
48    39
49    37

# 31-50

In [13]:
df2.age2.mean()

38.46

In [14]:
df2.age2.median()

37.5

In [15]:
df2.age2.std()

5.253609060756739